Ramp/unsteady/predict/reference/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 30;

boundaryField
{
    inlet
    {
        type              fixedValue;
        value             $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    "(sym.*|top)"
    {
        type            symmetry;
    }
    bot
    {
        type            omegaWallFunction;
        value           $internalField;
        blended         true;
    }

}



// ************************************************************************* //
